/******************************** User_library *********************************
* 文件名 	: STM32_SDCard.H
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2016/01/01
* 说明   	: 
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/


#include "STM32_WDG.H"
//#include "STM32F10x_BitBand.H"


//*******************************************************************************//
//*******************************************************************************//
//**********************************独立看门狗***********************************//
//*******************************************************************************//
//*******************************************************************************//

/*******************************************************************************
*函数名		:IWDG_Configuration
*功能描述	:独立看门狗配置
*输入			:Tout---超时复位时间，单位ms
*输出			:无
*返回值		:无
*例程			：
*说明			：看门狗溢出时间），该时间的计算方式为：Tout=((4×2^prer) ×rlr) /40
					：其中Tout 为看门狗溢出时间（单位为ms）；prer为看门狗时钟预分频值（IWDG_PR 值），
					：范围为0~7；rlr为看门狗的重装载值（IWDG_RLR 的值）；
					：比如我们设定prer值为4，rlr值为625，那么就可以得到Tout=64×625/40=1000ms，
*******************************************************************************/
void IWDG_Configuration(u32 Tout)
{
//	u32 Tout=0;
	u8 Prescaler=3;																//分频值
	u16 Reload=0;																	//计数值
	
	if(Tout*40/4/8<4095)
	{
		Prescaler=3;
		Reload=Tout*40/4/8;
	}
	else if(Tout*40/4/16<4095)
	{
		Prescaler=4;
		Reload=Tout*40/4/16;
	}
	else if(Tout*40/4/32<4095)
	{
		Prescaler=5;
		Reload=Tout*40/4/32;
	}
	else if(Tout*40/4/64<4095)
	{
		Prescaler=6;
		Reload=Tout*40/4/64;
	}
	if(Reload==0)
		Reload=1;
//	Reload=Tout*40/4/8<4095;
	
	//1--取消寄存器写保护
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);	//允许访问PR和RLR寄存器
	//2--设置看门狗时钟分频
	IWDG_SetPrescaler(Prescaler);				//设置分频
	//3--设置重装载初值
	IWDG_SetReload(Reload);													//设定计数器初值
	//4--装入初值，加载计数
	IWDG_ReloadCounter();
	//5--使能独立看门狗
	IWDG_Enable();
}

/*******************************************************************************
*函数名		:IWDG_Feed
*功能描述	:独立看门狗喂猪
*输入			:无
*输出			:无
*返回值		:无
*例程			：
*******************************************************************************/
void IWDG_Feed(void)
{
	IWDG_ReloadCounter();
}


//*******************************************************************************//
//*******************************************************************************//
//**********************************窗口看门狗***********************************//
//*******************************************************************************//
//*******************************************************************************//

/*******************************************************************************
*函数名		:IWDG_Configuration
*功能描述	:独立看门狗配置
*输入			:无
*输出			:无
*返回值		:无
*例程			：
*说明			：看门狗溢出时间），该时间的计算方式为：Tout=((4×2^prer) ×rlr) /40
					：其中Tout 为看门狗溢出时间（单位为ms）；prer为看门狗时钟预分频值（IWDG_PR 值），
					：范围为0~7；rlr为看门狗的重装载值（IWDG_RLR 的值）；
					：比如我们设定prer值为4，rlr值为625，那么就可以得到Tout=64×625/40=1000ms，
*******************************************************************************/
void WWDG_Configuration(void)
{
//	Tout
//	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);	//允许访问PR和RLR寄存器
//	IWDG_SetPrescaler(0);				//设置分频
//	IWDG_SetReload(0);					//设定计数器初值
//	IWDG_ReloadCounter();
//	IWDG_Enable();
}

/*******************************************************************************
*函数名		:IWDG_Feed
*功能描述	:独立看门狗喂猪
*输入			:无
*输出			:无
*返回值		:无
*例程			：
*******************************************************************************/
void WWDG_Feed(void)
{
//	IWDG_ReloadCounter();
}





