/******************************** User_library *********************************
* 文件名 	: SPI_FLASH.C
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2017/04/16
* 说明   	: 
********************************************************************************
SPI_FLASH使用功能测试
1）需要宏定义 SPI_FLASH
2）使用USB_TEST 板测试
3）需要宏定义SPI引脚

*******************************************************************************/
#ifdef A3987_TEST							//如果定义了A3987_TEST 此功能生效



#include "A3987_TEST.H"
#include "STM32_PWM.H"
#include "STM32_SYS.H"
#include "STM32_A3987.H"

u8 PUL_FLG=0;
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void A3987_TEST_Configuration(void)
{
	
	SYS_Configuration();											//系统配置 STM32_SYS.H	
	
	A3987_GPIO_Configuration();
	A3987_SETUP();
	
//	PWM_Configuration(TIM2,7200,10000,50);		//运行指示灯配置
	PWM_OUT(TIM2,PWM_OUTChannel1,5,500);
		
	SysTick_Configuration(500);							//系统嘀嗒时钟配置72MHz,单位为uS
}

/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void A3987_TEST_Server(void)
{
	if(PUL_FLG==0)
	{
		PUL_FLG=1;
		A3987_PUL_LOW();
	}
	else
	{
		PUL_FLG=0;
		A3987_PUL_HIGH();
		
	}
}







































#endif
